data = [['принтер', 7100, 1], ['компьютер', 75000, 1], ['принтер', 3500, 8], ['клавиатура', 950, 15], ['веб-камера', 920, 8],
['монитор', 30000, 9], ['сканер', 7900, 15], ['веб-камера', 810, 9], ['компьютер', 57000, 5], ['компьютер', 46000, 1],
['мышь', 870, 1], ['монитор', 56000, 5], ['монитор', 47000, 3], ['сканер', 7800, 5], ['мышь', 730, 4], ['принтер', 43000, 10],
['клавиатура', 600, 2], ['сканер', 8400, 5], ['монитор', 74000, 3], ['принтер', 59000, 8], ['принтер', 30000, 15], ['клавиатура', 1200, 10], ['клавиатура', 1400, 4], ['компьютер', 75000, 8], ['принтер', 96000, 9],]

name_total = []
price_total = 0
quantity_total = 0

for name, price, quantity in data:
    price_total += price
    quantity_total += quantity
    if name not in name_total:
        name_total.append(name)


print(f'Общее количество единиц товара: {quantity_total} шт.')
print(f'Общая цена товаров на складе  : {price_total}р.')
print(f'На складе есть следующие наименования: {name_total}')